In [201]:
import pandas

In [202]:
!pip install pandas

Requirement already satisfied: pandas in c:\varakumari\varakumarijupyter\lib\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (1.24.1)
Requirement already satisfied: six>=1.5 in c:\varakumari\varakumarijupyter\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [203]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\varakumari\varakumarijupyter\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\varakumari\varakumarijupyter\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [204]:
!pip install pandas

Requirement already satisfied: pandas in c:\varakumari\varakumarijupyter\lib\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\varakumari\varakumarijupyter\lib\site-packages (from pandas) (1.24.1)
Requirement already satisfied: six>=1.5 in c:\varakumari\varakumarijupyter\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip available: 22.3 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [205]:
import pandas as pd

In [206]:
df=pd.read_excel(r"C:\Users\srm\Desktop\Student Marks-S.xlsx")
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,"SRM UNIVERSITY-AP, ANDHRA PRADESH",NaN,NaN,NaN,NaN,NaN,NaN
1,END SEMESTER PRACTICAL EXAMINATION ATTENDANCE ...,NaN,NaN,NaN,NaN,NaN,NaN
2,Batch:,NaN,Department & Section :,NaN,NaN,NaN,Semster:
3,Course Code & Name:,NaN,NaN,NaN,NaN,NaN,NaN
4,S.No,Register No.,Record,Observation,Project,Viva,Total
...,...,...,...,...,...,...,...
70,66,AP21110011346,NaN,NaN,NaN,NaN,0
71,67,AP21110011347,20,20,30,28,98
72,68,AP21110011348,20,20,30,30,100
73,69,AP21110011349,20,20,30,29,99
74,70,AP21110011350,20,20,28,28,96

In [207]:
a=df.iloc[4:,]

In [208]:
a

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
4,S.No,Register No.,Record,Observation,Project,Viva,Total
5,1,AP21110011281,20,20,30,28,98
6,2,AP21110011282,20,20,28,28,96
7,3,AP21110011283,20,20,30,30,100
8,4,AP21110011284,20,20,30,27,97
...,...,...,...,...,...,...,...
70,66,AP21110011346,NaN,NaN,NaN,NaN,0
71,67,AP21110011347,20,20,30,28,98
72,68,AP21110011348,20,20,30,30,100
73,69,AP21110011349,20,20,30,29,99
74,70,AP21110011350,20,20,28,28,96

In [209]:
type(a)

pandas.core.frame.DataFrame

In [210]:
a.columns=a.iloc[0]

In [211]:
a

4   S.No   Register No.  Record  Observation  Project  Viva  Total
4   S.No   Register No.  Record  Observation  Project  Viva  Total
5      1  AP21110011281      20           20       30    28     98
6      2  AP21110011282      20           20       28    28     96
7      3  AP21110011283      20           20       30    30    100
8      4  AP21110011284      20           20       30    27     97
..   ...            ...     ...          ...      ...   ...    ...
70    66  AP21110011346     NaN          NaN      NaN   NaN      0
71    67  AP21110011347      20           20       30    28     98
72    68  AP21110011348      20           20       30    30    100
73    69  AP21110011349      20           20       30    29     99
74    70  AP21110011350      20           20       28    28     96

[71 rows x 7 columns]

In [212]:
a.drop(4,inplace=True)

C:\Users\srm\AppData\Local\Temp\ipykernel_7948\1736557085.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a.drop(4,inplace=True)

In [213]:
a

4  S.No   Register No. Record Observation Project Viva Total
5     1  AP21110011281     20          20      30   28    98
6     2  AP21110011282     20          20      28   28    96
7     3  AP21110011283     20          20      30   30   100
8     4  AP21110011284     20          20      30   27    97
9     5  AP21110011285     20          20      28   28    96
..  ...            ...    ...         ...     ...  ...   ...
70   66  AP21110011346    NaN         NaN     NaN  NaN     0
71   67  AP21110011347     20          20      30   28    98
72   68  AP21110011348     20          20      30   30   100
73   69  AP21110011349     20          20      30   29    99
74   70  AP21110011350     20          20      28   28    96

[70 rows x 7 columns]

In [194]:
a

4  S.No   Register No. Record Observation Project Viva Total
0     1  AP21110011281     20          20      30   28    98
1     2  AP21110011282     20          20      28   28    96
2     3  AP21110011283     20          20      30   30   100
3     4  AP21110011284     20          20      30   27    97
4     5  AP21110011285     20          20      28   28    96
..  ...            ...    ...         ...     ...  ...   ...
65   66  AP21110011346    NaN         NaN     NaN  NaN     0
66   67  AP21110011347     20          20      30   28    98
67   68  AP21110011348     20          20      30   30   100
68   69  AP21110011349     20          20      30   29    99
69   70  AP21110011350     20          20      28   28    96

[70 rows x 7 columns]

In [195]:
a.reset_index(drop=True,inplace=False)

4  S.No   Register No. Record Observation Project Viva Total
0     1  AP21110011281     20          20      30   28    98
1     2  AP21110011282     20          20      28   28    96
2     3  AP21110011283     20          20      30   30   100
3     4  AP21110011284     20          20      30   27    97
4     5  AP21110011285     20          20      28   28    96
..  ...            ...    ...         ...     ...  ...   ...
65   66  AP21110011346    NaN         NaN     NaN  NaN     0
66   67  AP21110011347     20          20      30   28    98
67   68  AP21110011348     20          20      30   30   100
68   69  AP21110011349     20          20      30   29    99
69   70  AP21110011350     20          20      28   28    96

[70 rows x 7 columns]

In [196]:
a

4  S.No   Register No. Record Observation Project Viva Total
0     1  AP21110011281     20          20      30   28    98
1     2  AP21110011282     20          20      28   28    96
2     3  AP21110011283     20          20      30   30   100
3     4  AP21110011284     20          20      30   27    97
4     5  AP21110011285     20          20      28   28    96
..  ...            ...    ...         ...     ...  ...   ...
65   66  AP21110011346    NaN         NaN     NaN  NaN     0
66   67  AP21110011347     20          20      30   28    98
67   68  AP21110011348     20          20      30   30   100
68   69  AP21110011349     20          20      30   29    99
69   70  AP21110011350     20          20      28   28    96

[70 rows x 7 columns]

In [197]:
temp=a.sort_values(by=["Total"],ascending=False)

In [198]:
a

4  S.No   Register No. Record Observation Project Viva Total
0     1  AP21110011281     20          20      30   28    98
1     2  AP21110011282     20          20      28   28    96
2     3  AP21110011283     20          20      30   30   100
3     4  AP21110011284     20          20      30   27    97
4     5  AP21110011285     20          20      28   28    96
..  ...            ...    ...         ...     ...  ...   ...
65   66  AP21110011346    NaN         NaN     NaN  NaN     0
66   67  AP21110011347     20          20      30   28    98
67   68  AP21110011348     20          20      30   30   100
68   69  AP21110011349     20          20      30   29    99
69   70  AP21110011350     20          20      28   28    96

[70 rows x 7 columns]

In [199]:
temp

4  S.No   Register No. Record Observation Project Viva Total
35   36  AP21110011316     20          20      30   30   100
46   47  AP21110011327     20          20      30   30   100
20   21  AP21110011301     20          20      30   30   100
43   44  AP21110011324     20          20      30   30   100
18   19  AP21110011299     20          20      30   30   100
..  ...            ...    ...         ...     ...  ...   ...
25   26  AP21110011306    NaN         NaN     NaN  NaN     0
27   28  AP21110011308    NaN         NaN     NaN  NaN     0
65   66  AP21110011346    NaN         NaN     NaN  NaN     0
29   30  AP21110011310    NaN         NaN     NaN  NaN     0
34   35  AP21110011315    NaN         NaN     NaN  NaN     0

[70 rows x 7 columns]

In [200]:
temp.to_excel("text.xlsx",index=False)